# GetRebarHostData Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarHostData..::..GetRebarHostData Method
RebarHostData Class See Also
---
Gets a RebarHostData object referring to the specified rebar host element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static RebarHostData GetRebarHostData(
	Element host
)
```

Visual Basic
---
```text
Public Shared Function GetRebarHostData ( _
	host As Element _
) As RebarHostData
```

Visual C++
---
```text
public:
static RebarHostData^ GetRebarHostData(
	Element^ host
)
```

# ### Parameters
host
    Type: Autodesk.Revit.DB..::..Element An element to host rebar.
# ### Return Value
A RebarHostData object, or nullNothingnullptra null reference (Nothing in Visual Basic).
# Remarks
Returns nullNothingnullptra null reference (Nothing in Visual Basic) for elements that cannot ever be rebar hosts, such as levels.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace